nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_utils.c
/**
 * @file lcl_hadm_utils.c
 *
 * This file implements some utility functions for HADM
 */
/*
 * Copyright 2024 NXP
 * SPDX-License-Identifier: BSD-3-Clause
 */

/* === Includes ============================================================ */
#include "fsl_os_abstraction.h"
#include "EmbeddedTypes.h"
#include "tx_api.h"
#include "fsl_gpio.h"
#include "fsl_port.h"
#include "fsl_tpm.h"
#include "nxp_xcvr_lcl_ctrl.h"
#include "lcl_hadm_measurement.h"
#include "lcl_hadm_utils.h"
#include "lcl_xcvr_hal.h"
#include "math.h" /* for log() */
#include "fwk_platform_sensors.h"

/* === Types =============================================================== */

/* === Macros ============================================================== */

/* Size of a preallocted HAL result buffer. For now assuming that mode3/n_ap=4 is the largest step report */
#define HADM_HAL_BUFFER_SIZE (HADM_HAL_PKT_RAM_MAX_NB_STEPS_ENGAGED*BLE_HADM_STEP3_REPORT_SIZE(HADM_MAX_NB_ANTENNA_PATHS))

/* === Globals ============================================================= */
//uint32_t nvic_backup;

static BLE_HADM_SubeventConfig_t configBuffer[HADM_MAX_NB_HAL_CONFIG_BUFFERS];
static BLE_HADM_SubeventResultsData_t resultsDataBuffer[HADM_MAX_NB_SIMULT_RESULT_BUFFERS];
static uint8 gpHadmHalResultBuffer[HADM_MAX_NB_SIMULT_RESULT_BUFFERS*HADM_SNIFFER_DEVICE_NB*HADM_HAL_BUFFER_SIZE];

/* Conversion LUT for 2x2: from permutation index to antenna index */
/* "A1 is assigned to 1:1, A2 is assigned to 1:2, A3 is assigned to 2:1 and A4 is assigned to 2:2" */
static const uint8_t hadm_ant_perm_to_idx[2][HADM_MAX_NB_ANTENNA_PATHS] =
{
  {0U,0U,1U,1U}, // Init
  {0U,1U,0U,1U}  // Refl
};

/*! Antenna permutation index: N_AP=4*/
static const uint8_t hadm_ant_perm_to_ap[24][HADM_MAX_NB_ANTENNA_PATHS] =
{
    {0U, 1U, 2U, 3U}, // AP1, AP2, AP3, AP4
    {1U, 0U, 2U, 3U}, // AP2, AP1, AP3, AP4
    {0U, 2U, 1U, 3U}, // AP1, AP3, AP2, AP4
    {2U, 0U, 1U, 3U}, // AP3, AP1, AP2, AP4
    {2U, 1U, 0U, 3U}, // AP3, AP2, AP1, AP4
    {1U, 2U, 0U, 3U}, // AP2, AP3, AP1, AP4
    {0U, 1U, 3U, 2U}, // AP1, AP2, AP4, AP3
    {1U, 0U, 3U, 2U}, // AP2, AP1, AP4, AP3
    {0U, 3U, 1U, 2U}, // AP1, AP4, AP2, AP3
    {3U, 0U, 1U, 2U}, // AP4, AP1, AP2, AP3
    {3U, 1U, 0U, 2U}, // AP4, AP2, AP1, AP3
    {1U, 3U, 0U, 2U}, // AP2, AP4, AP1, AP3
    {0U, 3U, 2U, 1U}, // AP1, AP4, AP3, AP2
    {3U, 0U, 2U, 1U}, // AP4, AP1, AP3, AP2
    {0U, 2U, 3U, 1U}, // AP1, AP3, AP4, AP2
    {2U, 0U, 3U, 1U}, // AP3, AP1, AP4, AP2
    {2U, 3U, 0U, 1U}, // AP3, AP4, AP1, AP2
    {3U, 2U, 0U, 1U}, // AP4, AP3, AP1, AP2
    {3U, 1U, 2U, 0U}, // AP4, AP2, AP3, AP1
    {1U, 3U, 2U, 0U}, // AP2, AP4, AP3, AP1
    {3U, 2U, 1U, 0U}, // AP4, AP3, AP2, AP1
    {2U, 3U, 1U, 0U}, // AP3, AP4, AP2, AP1
    {2U, 1U, 3U, 0U}, // AP3, AP2, AP4, AP1
    {1U, 2U, 3U, 0U}, // AP2, AP3, AP4, AP1
};

static const int16_t hadm_rxtx_fine_latency[HADM_RTT_PHY_MAX] =
{
    HADM_RXTX_FINE_LATENCY_1MBPS_HNS,
    HADM_RXTX_FINE_LATENCY_2MBPS_HNS,
    HADM_RXTX_FINE_LATENCY_2MBPS_2BT_HNS,
};

static int32_t pct_sin_phase_offset[HADM_MAX_NB_ANTENNAS][HADM_MAX_CHANNELS];
static int32_t pct_cos_phase_offset[HADM_MAX_NB_ANTENNAS][HADM_MAX_CHANNELS];

/* === Externals =========================================================== */

/* === Prototypes ========================================================== */

/* === Implementation ====================================================== */

void lcl_hadm_utils_init_buffers(void)
{
    /* Initialise HAL config & results buffer */
    for (uint32_t i=0U; i < HADM_MAX_NB_HAL_CONFIG_BUFFERS; i++)
    {
        configBuffer[i].configBufferUsed = 0;
    }
    for (uint32_t i=0U; i < HADM_MAX_NB_SIMULT_RESULT_BUFFERS; i++)
    {
        resultsDataBuffer[i].resultBufferUsed = 0;
        resultsDataBuffer[i].resultBuffer = &gpHadmHalResultBuffer[(uint32_t)i*HADM_SNIFFER_DEVICE_NB*HADM_HAL_BUFFER_SIZE];
        resultsDataBuffer[i].resultBuffer2 = &gpHadmHalResultBuffer[((uint32_t)i*HADM_SNIFFER_DEVICE_NB+1U)*HADM_HAL_BUFFER_SIZE];
        resultsDataBuffer[i].resultBufferSize = HADM_HAL_BUFFER_SIZE;
    }
}

/* Allocate one HAL config buffer */
BLE_HADM_SubeventConfig_t *lcl_hadm_utils_get_config_buffer(void)
{
    BLE_HADM_SubeventConfig_t *config_p = NULL;
    
    for (uint32_t i=0U; i < HADM_MAX_NB_HAL_CONFIG_BUFFERS; i++)
    {
        if (configBuffer[i].configBufferUsed == 0U)
        {
            config_p = &configBuffer[i];
            config_p->configBufferUsed = 1;
            config_p->stepsNb = 0;
            config_p->role = HADM_ROLE_INVALID;
            break;
        }
    }
    return config_p;
}

/* Free HAL config buffer(s) belonging to connIdx */
void lcl_hadm_utils_free_config_buffer(uint8 connIdx)
{
    for (uint32_t i=0U; i < HADM_MAX_NB_HAL_CONFIG_BUFFERS; i++)
    {
        if ((configBuffer[i].configBufferUsed == 1U) && (configBuffer[i].connIdx == connIdx))
        {
            configBuffer[i].configBufferUsed = 0;
        }
    }
}

/* Allocate one HAL result buffer */
BLE_HADM_SubeventResultsData_t *lcl_hadm_utils_get_result_buffer(void)
{
    BLE_HADM_SubeventResultsData_t *result_p = NULL;
    
    for (uint32_t i=0U; i < HADM_MAX_NB_SIMULT_RESULT_BUFFERS; i++)
    {
        if (resultsDataBuffer[i].resultBufferUsed == 0U)
        {
            result_p = &resultsDataBuffer[i];
            result_p->resultBufferUsed = 1;
            result_p->debugBuffer = NULL;
            result_p->debugBufferSize = 0;
            result_p->nbStepsCollected = 0;
            result_p->firstStepCollected = 0;

            /* Do some inits */
            result_p->referencePwrLevel = HADM_INVALID_REFERENCE_POWER_LEVEL;
            result_p->referencePwrLevel2 = HADM_INVALID_REFERENCE_POWER_LEVEL;
            result_p->frequencyCompensation = (int16)0xC000;
            result_p->syncDelayUs = 0;
            break;
        }
    }
    return result_p;
}

/* Free HAL config buffer(s) belonging to connIdx */
void lcl_hadm_utils_free_result_buffer(uint8 connIdx)
{
    for (uint32_t i=0U; i < HADM_MAX_NB_SIMULT_RESULT_BUFFERS; i++)
    {
        if ((resultsDataBuffer[i].resultBufferUsed == 1U) && (resultsDataBuffer[i].connIdx == connIdx))
        {
            resultsDataBuffer[i].resultBufferUsed = 0U;
        }
    }
}

#ifdef HADM_PLL_CAL_INTERPOLATION
uint16_t lcl_hadm_get_hpm_cal_interpolation(uint8_t chan, uint16_t ref_cal)
{ 
    uint32_t temp_cal;
    /* This array contains Fref^3 / freq^3 for all HADM channels 0..78, stored in fixed-point Q7 format */
    /* with Fref = 2442 MHz (channel 40) */
    static const uint8_t hpm_interp_fact[HADM_MAX_CHANNELS] = 
    {
         135, 134, 134, 134, 134, 134, 133, 133, 133, 133, 133, 133, 133, 132, 132, 132, 132, 132, 132, 131, 131, 131, 131, 131, 131, 130, 130, 130, 130, 
         130, 130, 129, 129, 129, 129, 129, 129, 128, 128, 128, 128, 128, 128, 128, 127, 127, 127, 127, 127, 127, 126, 126, 126, 126, 126, 126, 126, 125, 
         125, 125, 125, 125, 125, 124, 124, 124, 124, 124, 124, 124, 123, 123, 123, 123, 123, 123, 123, 122, 122
    };
    temp_cal = (uint32_t)hpm_interp_fact[chan];
    temp_cal = (temp_cal * ref_cal) >> 7U; /* compensate for Q7 format */

    return (uint16_t)temp_cal;
}
#endif

/* Compute RTT latency for a given temperature.
 * Characterization has shown that the delay can be approximated as a polynomial of degree 2.
 * Curve is positioned on Y axis (hence the -1) so that there's no delay at 25 degrees C which is the recommended
 * temperature to perform zero distance calibration.
 * This will also guarantee normal behavior at 25 degrees C if the host does not transmit temperature information (hcibb).
 * For 1MBPS: delay (half ns) = 0.0014x^2 + 0.15x
 * For 2MBPS: delay (half ns) = 0.0016x^2 + 0.1462x
 * Fixed point conversions:
 *      0.0014 => 22.9*2^14
 *      0.0016 => 26.2*2^14
 *      0.15 => 2457.6*2^14
 *      0.1462 => 2395.3*2^14
 * Return: half ns unit
 */
#define HADM_RTT_SCALE_FACTOR      (0x4000)     /* (1<<14) */
#define HADM_RTT_SCALE_FACTOR_HALF (HADM_RTT_SCALE_FACTOR / 2)
#define HADM_RTT_SCALE_FACTOR_4    (0x10)       /* (1<<(5-1)) */
#define HADM_CALC_RTT_TEMP_DELAY_1MBPS(_TEMP) ((((23 * (_TEMP) + 2457) * (_TEMP)) / HADM_RTT_SCALE_FACTOR))
#define HADM_CALC_RTT_TEMP_DELAY_2MBPS(_TEMP) ((((26 * (_TEMP) + 2395) * (_TEMP)) / HADM_RTT_SCALE_FACTOR))

void lcl_hadm_utils_calc_rtt_temperature_delay(int32_t temperature, hadm_device_t *hadm_device_p)
{
    hadm_device_p->rtt_temperature_comp_hns[HADM_RTT_PHY_1MBPS] = HADM_CALC_RTT_TEMP_DELAY_1MBPS(temperature);
    hadm_device_p->rtt_temperature_comp_hns[HADM_RTT_PHY_2MBPS] = HADM_CALC_RTT_TEMP_DELAY_2MBPS(temperature);
    /* It is assumed that 2MBPS BT2.0 modulation has the same delay as 2MBPS BT0.5 */
    hadm_device_p->rtt_temperature_comp_hns[HADM_RTT_PHY_2MBPS_2BT] = hadm_device_p->rtt_temperature_comp_hns[HADM_RTT_PHY_2MBPS];
}

/* Compute device-specific constant contributions to RTT delay */
void lcl_hadm_utils_calc_rtt_static_delay(hadm_device_t *hadm_device_p)
{
    int32_t static_delay_hns;

    /* 1Mbps*/
    /* RCCal delay in hns = -0.774*(rccal-17) ns * 2 (0.774 in fixed point s14 = 12681) */
    static_delay_hns = (((int32_t)hadm_device_p->rtt_static_comp.rttRCcal - HADM_RCCAL_CENTER) * (-12681)) / HADM_RTT_SCALE_FACTOR_HALF;

    /* CBPF attenuation delay in ns = 14.86(a-6.5). Since a is stored *100 => in hns = 2*14.86(a-6.5)/100. (14.86 in fixed point s5 = 475) */
    hadm_device_p->rtt_static_comp_hns[HADM_RTT_PHY_1MBPS] = static_delay_hns +
       ((((int32_t)hadm_device_p->rtt_static_comp.rttCbpfAtt[HADM_RTT_PHY_1MBPS] - HADM_CBPF_ATTEN_CENTER_1MBPS) * 475) / (100*HADM_RTT_SCALE_FACTOR_4));

