nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_utils.c
#define PCT_FIXED_POINT_UNIT  14U
#define PCT_FIXED_POINT_ONE   0x4000U   /* unsigned 1 << PCT_FIXED_POINT_UNIT */

void lcl_hadm_measurement_phase_rotation(uint32_t *iq, uint8_t ch, uint8_t ant_id)
{
    int32_t i_out, q_out;
    uint32_t i = (*iq & 0x000fffU);
    uint32_t q = (*iq & 0xfff000U) >> 12U;

    /* convert i & q from s12.0 format to int32_t. Still do in uint32_t */
    i = i | (((i & 0x800U) != 0U) ? 0xfffff000U : 0U);
    q = q | (((q & 0x800U) != 0U) ? 0xfffff000U : 0U);
    /* phase offset in fixed point 18.14 */
    i_out = (((int32_t)i * pct_cos_phase_offset[ant_id][ch]) - ((int32_t)q * pct_sin_phase_offset[ant_id][ch])) / (int32_t)PCT_FIXED_POINT_ONE;
    q_out = (((int32_t)q * pct_cos_phase_offset[ant_id][ch]) + ((int32_t)i * pct_sin_phase_offset[ant_id][ch])) / (int32_t)PCT_FIXED_POINT_ONE;

    *iq = ((uint32_t)i_out & 0xfffU) | (((uint32_t)q_out & 0xfffU) << 12U);
}

/**
 * Initialize phase offset to default values.
 * Phase rotation happens but no rotation is applied.
 */
void lcl_hadm_init_phase_offset(void)
{
    BLE_HADM_PCTPhaseRotation_t defaultPCTRotation;
    defaultPCTRotation.offset_table[0] = 0;
    defaultPCTRotation.offset_table[1] = 0;
    defaultPCTRotation.offset_table[2] = 0;
    defaultPCTRotation.offset_table[3] = 0;
    lcl_hadm_utils_calc_phase_rotation_offset(&defaultPCTRotation);
}

#define PI_4_FIXED_POINT      12868U  /* PI/4    * 2^14 */
#define PI_2_FIXED_POINT      25736U  /* PI/2    * 2^14 */
#define PI_FIXED_POINT        51472U  /* PI      * 2^14 */
#define TWO_PI_FIXED_POINT    102943U /* 2*PI    * 2^14 */

#define FACT_2_FIXED_POINT    8192U   /* 1/2    * 2^14 */
#define FACT_3_FIXED_POINT    2730U   /* 1/6    * 2^14 */
#define FACT_4_FIXED_POINT    682U    /* 1/24   * 2^14 */
#define FACT_5_FIXED_POINT    136U    /* 1/120  * 2^14  */
#define FACT_6_FIXED_POINT    23U     /* 1/720  * 2^14 */

/* Note: input and output should be in fixed point 18.14 format */
static uint32_t lcl_utils_sqrt_fixed_point(uint32_t x)
{
    uint32_t temp, guess;
    uint8_t msb_pos;

    /* x must be positive and not bigger than 1<<14 */
    if ((x == 0U) || (x > PCT_FIXED_POINT_ONE)) { return 0U; }
    /* sqrt(1) = 1 */
    if (x == PCT_FIXED_POINT_ONE) { return PCT_FIXED_POINT_ONE; }

    /* Find the position of the most significant bit */
    temp = x;
    msb_pos = 0U;
    while (temp > 1U)
    {
        temp >>= 1U;
        msb_pos++;
    }

    /* Initial guess based on bit position */
    guess = (uint32_t)1U << (msb_pos >> 1U);
    if ((msb_pos & 1U) != 0U)
    {
        /* Adjust for odd bit positions */
        guess += (guess >> 1U);
    }

    /* Ensure guess is in proper fixed-point range */
    if (guess < (1U << (PCT_FIXED_POINT_UNIT / 2U)))
    {
        /* Minimum reasonable guess */
        guess = (1U << (PCT_FIXED_POINT_UNIT / 2U));
    }

    /* Heron's iterations */
    for (int i = 0; i < 8; i++)
    {
        uint32_t quotient, prev_guess;
        int32_t diff;

        prev_guess = guess;

        /* Calculate x/guess. x is smaller than 1<<14 then left shift by 14 won't overflow uint32_t */
        quotient = (x << PCT_FIXED_POINT_UNIT) / guess;
        guess = (guess + quotient) >> 1U;

        /* Check for convergence */
        diff = (int32_t)(uint32_t)(guess - prev_guess);
        if (diff < 0)
        {
            diff = -diff;
        }
        if (diff < 2) { break; } /* Converged */
    }
    return guess;
}

/* Returned range [0, PI_2_FIXED_POINT] */
static uint32_t lcl_utils_normalize_angle(int32_t angle, int32_t *cos_sign, int32_t *sin_sign)
{
    uint32_t angle_norm;
    *cos_sign = 1;
    *sin_sign = 1;

    /* Normalize angle to [0, 2*PI] */
    while (angle >= (int32_t)TWO_PI_FIXED_POINT) { angle -= (int32_t)TWO_PI_FIXED_POINT; }
    while (angle < 0) { angle += (int32_t)TWO_PI_FIXED_POINT; }

    angle_norm = (uint32_t)angle;
    /* Use symmetry to reduce to [0, PI/2] */
    if (angle_norm > PI_FIXED_POINT) {
        angle_norm = TWO_PI_FIXED_POINT - angle_norm;
        *sin_sign = -1;
    }
    if (angle_norm > PI_2_FIXED_POINT) {
        angle_norm = PI_FIXED_POINT - angle_norm;
        *cos_sign = -1;
    }
    return angle_norm;
}

/* Note: input and output should be in fixed point 18.14 */
static uint32_t lcl_utils_compute_sine_fixed_point(uint32_t angle)
{
    uint32_t x, x2, x3, x5;

    if (angle > PI_4_FIXED_POINT) { return 0U; }

    /* Taylor series: sin(x) = x - x^3/3! + x^5/5! - x^7/7! */
    x = angle;
    x2 = (x * x)   >> PCT_FIXED_POINT_UNIT;
    x3 = (x2 * x)  >> PCT_FIXED_POINT_UNIT;
    x5 = (x3 * x2) >> PCT_FIXED_POINT_UNIT;

    return (x - ((x3 * FACT_3_FIXED_POINT) >> PCT_FIXED_POINT_UNIT) + ((x5 * FACT_5_FIXED_POINT >> PCT_FIXED_POINT_UNIT)));
}

static uint32_t lcl_utils_compute_cosine_fixed_point(uint32_t angle)
{
    uint32_t x, x2, x4, x6;

    assert(angle <= PI_4_FIXED_POINT);
    if (angle > PI_4_FIXED_POINT) { return 0U; }
   
    /* Taylor series: cos(x) = 1 - x^2/2! + x^4/4! -x^6/6! */
    x = angle;
    x2 = (x * x)   >> PCT_FIXED_POINT_UNIT;
    x4 = (x2 * x2) >> PCT_FIXED_POINT_UNIT;
    x6 = (x4 * x2) >> PCT_FIXED_POINT_UNIT;

    return (PCT_FIXED_POINT_ONE - ((x2 * FACT_2_FIXED_POINT) >> PCT_FIXED_POINT_UNIT) + ((x4 * FACT_4_FIXED_POINT) >> PCT_FIXED_POINT_UNIT) - ((x6 * FACT_6_FIXED_POINT) >> PCT_FIXED_POINT_UNIT));
}

void lcl_hadm_utils_calc_phase_rotation_offset(BLE_HADM_PCTPhaseRotation_t *phaseRotation)
{ 
    int32_t angle_fp;
    int32_t cos_sign, sin_sign;
    uint32_t norm_angle_fp, sine;

    for (uint32_t ant_id=0U; ant_id<HADM_MAX_NB_ANTENNAS; ant_id++)
    {
        angle_fp = phaseRotation->offset_table[ant_id] + HADM_DEFAULT_PCT_ROTATION;
        if(angle_fp != 0)
        {
            for (uint32_t chn=0U; chn<HADM_MAX_CHANNELS; chn++)
            {
                norm_angle_fp = lcl_utils_normalize_angle(angle_fp * (int32_t)chn, &cos_sign, &sin_sign);
                if (norm_angle_fp < PI_4_FIXED_POINT)
                {
                    sine = lcl_utils_compute_sine_fixed_point(norm_angle_fp);
                }
                else
                {
                    sine = lcl_utils_compute_cosine_fixed_point(PI_2_FIXED_POINT - norm_angle_fp);
                }
                pct_sin_phase_offset[ant_id][chn] = sin_sign * (int32_t)sine;
                pct_cos_phase_offset[ant_id][chn] = cos_sign * (int32_t)lcl_utils_sqrt_fixed_point((((uint32_t)1<<(2U*PCT_FIXED_POINT_UNIT)) - (sine*sine)) >> (uint32_t)PCT_FIXED_POINT_UNIT);
            }
        }
    }
}

void lcl_hadm_utils_get_antenna_id_sequence(hadm_meas_t *hadm_meas_p, uint8_t step_id, uint8_t *ant_id_seq)
{
    
    if (is_single_antenna_config(hadm_meas_p))
    {
        /* A single antenna configuration requires no permutation, only antenna_id 0 is used */
        (void)memset(ant_id_seq, 0, HADM_MAX_NB_ANTENNAS);
    }
    else
    {
        /* Perform antenna permutation index to antenna index mapping */
        uint8_t role = (uint8_t)hadm_meas_p->config_p->role;
        uint8_t perm_idx = (uint8_t)hadm_meas_p->config_p->chModePmAntMap[step_id].ant_perm;

        if (hadm_meas_p->config_p->toneAntennaConfigIdx == HADM_ANT_CFG_IDX_7) 
        {
            for (uint32_t i = 0U; i < HADM_MAX_NB_ANTENNAS; i++)
            {
                /* Map antenna paths for 2:2 configuration */
                ant_id_seq[i] = hadm_ant_perm_to_idx[role][hadm_ant_perm_to_ap[perm_idx][i]];
            }
        }
        else
        {
            /* Direct mapping btw antenna path and antenna id*/
            (void)memcpy(ant_id_seq, hadm_ant_perm_to_ap[perm_idx], HADM_MAX_NB_ANTENNAS);
        }
    }
}
/* EOF */
